     EASYPLI_DATA_PROCESSING_UTILITY PROGRAM;

     /* MAIN ENTRY POINT */
     DECLARE I FIXED BINARY INIT(0);
     DECLARE DATA_RECORD CHARACTER(100);
     DECLARE IS_EOF BIT;

     /* OPEN INPUT FILE */
     OPEN FILE(INPUT_FILE) RECORD;
     OPEN FILE(OUTPUT_FILE) RECORD;

     DO WHILE(IS_EOF = '0'B);
        READ FILE(INPUT_FILE) INTO(DATA_RECORD);
        IF ERROR THEN IS_EOF = '1'B;
        ELSE DO;
           /* PARSE DATA */
           CALL PARSE_DATA(DATA_RECORD);
           /* TRANSFORM DATA */
           CALL TRANSFORM_DATA(DATA_RECORD);
           /* VALIDATE DATA */
           IF VALIDATE_DATA(DATA_RECORD) THEN
              WRITE FILE(OUTPUT_FILE) FROM(DATA_RECORD);
        END;
     END;

     CLOSE FILE(INPUT_FILE);
     CLOSE FILE(OUTPUT_FILE);

     END EASYPLI_DATA_PROCESSING_UTILITY;
