     PARSE_DATA MODULE(DATA_RECORD);

     /* PARSE DATA MODULE */
     DECLARE DATA_RECORD CHARACTER(100);
     DECLARE FIELD1 CHARACTER(20);
     DECLARE FIELD2 CHARACTER(20);
     DECLARE FIELD3 CHARACTER(20);

     /* EXTRACT FIELDS */
     FIELD1 = SUBSTR(DATA_RECORD, 1, 20);
     FIELD2 = SUBSTR(DATA_RECORD, 21, 20);
     FIELD3 = SUBSTR(DATA_RECORD, 41, 20);

     /* PROCESS FIELDS */
     CALL PROCESS_FIELD1(FIELD1);
     CALL PROCESS_FIELD2(FIELD2);
     CALL PROCESS_FIELD3(FIELD3);

     END PARSE_DATA;
