     REPORTER MODULE(DATA_RECORD);

     /* REPORTER MODULE */
     DECLARE DATA_RECORD CHARACTER(100);
     DECLARE REPORT_RECORD CHARACTER(100);

     /* GENERATE REPORT RECORD */
     REPORT_RECORD = 'Record Processed: ' || DATA_RECORD;

     /* WRITE REPORT */
     WRITE FILE(REPORT_FILE) FROM(REPORT_RECORD);

     END REPORTER;
