     VALIDATE_DATA MODULE(DATA_RECORD);

     /* VALIDATE DATA MODULE */
     DECLARE DATA_RECORD CHARACTER(100);
     DECLARE IS_VALID BIT INIT('1'B);

     /* CHECK FOR EMPTY RECORD */
     IF DATA_RECORD = '' THEN IS_VALID = '0'B;

     /* ADD MORE VALIDATION RULES AS NEEDED */

     VALIDATE_DATA = IS_VALID;

     END VALIDATE_DATA;
